Библиотека/src/Documents/СписаниеКниг/СписаниеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеКниг</name>
  <registerRecords>AccumulationRegister.КнигиВБиблиотеке</registerRecords>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека/src/AccumulationRegisters/КнигиВБиблиотеке/КнигиВБиблиотеке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигиВБиблиотеке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.Операция</types>
    </type>
  </attributes>
  <dimensions>
    <name>Книга</name>
    <type>
      <types>CatalogRef.Книги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоРазмещения</name>
    <type>
      <types>CatalogRef.Абоненты</types>
      <types>CatalogRef.МестаРазмещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Библиотека/src/Enums/Операция/Операция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Операция</name>
  <enumValues>
    <name>ПоступлениеКниг</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаКнигиАбоненту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКнигиАбонентом</name>
  </enumValues>
  <enumValues>
    <name>СписаниеКниг</name>
  </enumValues>
</mdclass:Enum>

Библиотека/src/Documents/СписаниеКниг/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Книги.Книга
		|ПОМЕСТИТЬ Книги
		|ИЗ
		|	&Книги КАК Книги
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КнигиВБиблиотекеОстатки.Книга,
		|	КнигиВБиблиотекеОстатки.МестоРазмещения,
		|	КнигиВБиблиотекеОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.КнигиВБиблиотеке.Остатки(&Период, ) КАК КнигиВБиблиотекеОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Книги КАК Книги
		|		ПО КнигиВБиблиотекеОстатки.Книга = Книги.Книга
		|ГДЕ
		|	КнигиВБиблиотекеОстатки.КоличествоОстаток = 1";

	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Книги", Книги.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	// регистр КнигиВБиблиотеке Расход
	Движения.КнигиВБиблиотеке.Записывать = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.КнигиВБиблиотеке.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Книга = ВыборкаДетальныеЗаписи.Книга;
		Движение.МестоРазмещения = ВыборкаДетальныеЗаписи.МестоРазмещения;
		Движение.Количество = ВыборкаДетальныеЗаписи.КоличествоОстаток;
		Движение.Операция = Перечисления.Операция.СписаниеКниг;	
	КонецЦикла;
	
КонецПроцедуры
